warehouse-app/app/controllers/warehouses_controller.rb

    def create
        warehouse_params = params.require(:warehouse).permit(:name, :code, :city, :description, :adress, :cep, :area)
        @warehouse = Warehouse.new(warehouse_params)
        if @warehouse.save()
---
INSERT INTO "warehouses" ("name", "code", "city", "area", "created_at", "updated_at", "adress", "cep", "description") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
      warehouse_params = params.require(:warehouse).permit(:name, :code, :city, :description, :adress, :cep, :area)
      if @warehouse.update(warehouse_params)
---
UPDATE "warehouses" SET "name" = ?, "area" = ?, "updated_at" = ?, "adress" = ?, "cep" = ? WHERE "warehouses"."id" = ?  [["name", "Galpão Internacional"], ["area", 200000], ["updated_at", "2023-11-07 14:05:20.770762"], ["adress", "Avenida dos Galpões, 500"], ["cep", "16000-000"], ["id", 1]]

    def destroy
      @warehouse.destroy
---
DELETE FROM "warehouses" WHERE "warehouses"."id" = ?  [["id", 2]]